archive/Emacs/Notes.org
* DONE Create a java maven project
  CLOSED: [2018-10-23 Tue 20:05]
#+BEGIN_SRC sh
mvn archetype:generate -DgroupId=org.test.autobuild -DartifactId=autobuildtestprj -DarchetypeArtifactId=maven-archetype-quickstart -DinteractiveMode=false
#+END_SRC

;; Maven default pom.xml before change
#+BEGIN_SRC xml
<project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
  <modelVersion>4.0.0</modelVersion>
  <groupId>org.test.autobuild</groupId>
  <artifactId>autobuildtestprj</artifactId>
  <packaging>jar</packaging>
  <version>1.0-SNAPSHOT</version>
  <name>autobuildtestprj</name>
  <url>http://maven.apache.org</url>
  <dependencies>
    <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
      <scope>test</scope>
    </dependency>
  </dependencies>
</project>

#+END_SRC

* Add maven release plugin
[[http://maven.apache.org/maven-release/maven-release-plugin/usage.html][Maven-Release-Plugin Usage]]
[[http://maven.apache.org/maven-release/maven-release-plugin/][Maven Release Plugin]]
** Maven release plugin requires scm tag with developerConnection pointing to scm's pom.xml folder
*** Initialize git in current project
#+BEGIN_SRC sh
git init
#+END_SRC
*** Add scm section
#+BEGIN_SRC xml
<scm>
    <developerConnection>scm:git:file:///Users/pramod/Programming/try/mavenabutobuilder/firstprj/autobuildtestprj</developerConnection>
  </scm>
#+END_SRC
*** Add build tag
#+BEGIN_SRC xml
<build>
    <plugins>
      <plugin>
        <groupId>org.apache.maven.plugins</groupId>
        <artifactId>maven-release-plugin</artifactId>
        <version>2.5.3</version>
      </plugin>
    </plugins>
#+END_SRC
*** Provide release version
#+BEGIN_SRC sh
What is the release version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 1.0: : 4.5.1
What is SCM release tag or label for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) autobuildtestprj-1.0: : prod
What is the new development version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 1.1-SNAPSHOT: : 4.6.1-SNAPSHOT
#+END_SRC
*** Release prepare
#+BEGIN_SRC sh
mvn release:prepare -DdryRun=true  # set up version
mvn release:prepare  # prepare version, may setup above
mvn release:clean # Removes all fils created above
mvn release:perform
#+END_SRC
*** Add distributionManagementTag
#+BEGIN_SRC xml
<distributionManagement>
      <!-- use the following if you're not using a snapshot version. -->
      <repository>
          <id>localSnap</id>
          <name>RepositoryProxyRel</name>
          <url>file:///Users/pramod/Documents/autobuildtestprj</url>
      </repository>
  </distributionManagement>

#+END_SRC
** Remove recursive git (i.e git prj insdie git prj) :( like in my case
** Return release
#+BEGIN_SRC sh
mvn release:prepare
#+END_SRC
* Add remote git repository and modify pom.xml accordingly
#+BEGIN_SRC sh
 mkdir autobuildtestremoteprj
cd autobuildtestremoteprj/
git init --bare .
cd ..
ls
cd autobuildtestprj/
ls
git remote add origin file:///Users/pramod/Documents/autobuildtestremoteprj
git push origin master
#+END_SRC
* Finally execute
#+BEGIN_SRC
mvn release:clean
mvn release:prepare
mvn release:perform
# Don't use release tag, as it was already used
#+END_SRC
