Emacs/Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-23 Tue 22:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pramod Nepal" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd55dcaa">1. <span class="done DONE">DONE</span> Create a java maven project</a></li>
<li><a href="#orga079023">2. Add maven release plugin</a>
<ul>
<li><a href="#orgfd5104e">2.1. Maven release plugin requires scm tag with developerConnection pointing to scm's pom.xml folder</a>
<ul>
<li><a href="#org4d8e3c9">2.1.1. Initialize git in current project</a></li>
<li><a href="#orgf910353">2.1.2. Add scm section</a></li>
<li><a href="#org41d667a">2.1.3. Add build tag</a></li>
<li><a href="#orgf87d3f9">2.1.4. Provide release version</a></li>
<li><a href="#org5b1729b">2.1.5. Release prepare</a></li>
<li><a href="#org0194e41">2.1.6. Add distributionManagementTag</a></li>
</ul>
</li>
<li><a href="#org8dafcf5">2.2. Remove recursive git (i.e git prj insdie git prj) :( like in my case</a></li>
<li><a href="#org79a6729">2.3. Return release</a></li>
</ul>
</li>
<li><a href="#org60f8c0d">3. Add remote git repository and modify pom.xml accordingly</a></li>
<li><a href="#org2c87862">4. Finally execute</a></li>
<li><a href="#org928c771">5. Output</a></li>
<li><a href="#orged4ff23">6. Modified pom.xml</a></li>
<li><a href="#org3481aa3">7. At this point set of commands</a></li>
<li><a href="#org7778499">8. Develop will still work with SNAPSHOT</a></li>
<li><a href="#orgcc3b439">9. Next execute mvn release:perform (Error)</a></li>
<li><a href="#orgdf56af3">10. Log</a></li>
<li><a href="#org0618dda">11. Now able to automate with mvn release:prepare and release:perform</a></li>
<li><a href="#orgffa788f">12. Batch mode options</a></li>
<li><a href="#orgf0dd951">13. Revisit pom.xml with all the changes</a></li>
<li><a href="#org59cbf04">14. Links</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd55dcaa" class="outline-2">
<h2 id="orgd55dcaa"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Create a java maven project</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">mvn archetype:generate -DgroupId=org.test.autobuild -DartifactId=autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j -DarchetypeArtifactId=maven-archetype-quickstart -DinteractiveMode=false</span>
</pre>
</div>

<p>
;; Maven default pom.xml before change
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">project</span> <span style="color: #4c83ff;">xmlns</span>=<span style="color: #61CE3C;">"http://maven.apache.org/POM/4.0.0"</span> <span style="color: #4c83ff;">xmlns</span>:<span style="color: #ff69b4;">xsi</span>=<span style="color: #61CE3C;">"http://www.w3.org/</span><span style="color: #dc8cc3; background-color: #383838;">2001/XMLSchema-instance"</span>
  <span style="color: #4c83ff;">xsi</span>:<span style="color: #ff69b4;">schemaLocation</span>=<span style="color: #61CE3C;">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/</span><span style="color: #dc8cc3; background-color: #383838;">maven-v4_0_0.xsd"</span><span style="color: #dc8cc3; background-color: #383838;">&gt;</span>
  &lt;<span style="color: #ff1493;">modelVersion</span>&gt;4.0.0&lt;/<span style="color: #ff1493;">modelVersion</span>&gt;
  &lt;<span style="color: #ff1493;">groupId</span>&gt;org.test.autobuild&lt;/<span style="color: #ff1493;">groupId</span>&gt;
  &lt;<span style="color: #ff1493;">artifactId</span>&gt;autobuildtestprj&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
  &lt;<span style="color: #ff1493;">packaging</span>&gt;jar&lt;/<span style="color: #ff1493;">packaging</span>&gt;
  &lt;<span style="color: #ff1493;">version</span>&gt;1.0-SNAPSHOT&lt;/<span style="color: #ff1493;">version</span>&gt;
  &lt;<span style="color: #ff1493;">name</span>&gt;autobuildtestprj&lt;/<span style="color: #ff1493;">name</span>&gt;
  &lt;<span style="color: #ff1493;">url</span>&gt;http://maven.apache.org&lt;/<span style="color: #ff1493;">url</span>&gt;
  &lt;<span style="color: #ff1493;">dependencies</span>&gt;
    &lt;<span style="color: #ff1493;">dependency</span>&gt;
      &lt;<span style="color: #ff1493;">groupId</span>&gt;junit&lt;/<span style="color: #ff1493;">groupId</span>&gt;
      &lt;<span style="color: #ff1493;">artifactId</span>&gt;junit&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
      &lt;<span style="color: #ff1493;">version</span>&gt;3.8.1&lt;/<span style="color: #ff1493;">version</span>&gt;
      &lt;<span style="color: #ff1493;">scope</span>&gt;test&lt;/<span style="color: #ff1493;">scope</span>&gt;
    &lt;/<span style="color: #ff1493;">dependency</span>&gt;
  &lt;/<span style="color: #ff1493;">dependencies</span>&gt;
&lt;/<span style="color: #ff1493;">project</span>&gt;

</pre>
</div>
</div>
</div>

<div id="outline-container-orga079023" class="outline-2">
<h2 id="orga079023"><span class="section-number-2">2</span> Add maven release plugin</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://maven.apache.org/maven-release/maven-release-plugin/usage.html">Maven-Release-Plugin Usage</a>
<a href="http://maven.apache.org/maven-release/maven-release-plugin/">Maven Release Plugin</a>
</p>
</div>
<div id="outline-container-orgfd5104e" class="outline-3">
<h3 id="orgfd5104e"><span class="section-number-3">2.1</span> Maven release plugin requires scm tag with developerConnection pointing to scm's pom.xml folder</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org4d8e3c9" class="outline-4">
<h4 id="org4d8e3c9"><span class="section-number-4">2.1.1</span> Initialize git in current project</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-sh">git init
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf910353" class="outline-4">
<h4 id="orgf910353"><span class="section-number-4">2.1.2</span> Add scm section</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">scm</span>&gt;
    &lt;<span style="color: #ff1493;">developerConnection</span>&gt;scm:git:file:///Users/pramod/Programming/try/mavenabuto<span style="color: #dc8cc3; background-color: #383838;">builder/firstprj/autobuildtestprj</span><span style="color: #dc8cc3; background-color: #383838;">&lt;</span><span style="color: #dc8cc3; background-color: #383838;">/</span><span style="color: #dc8cc3; background-color: #383838;">developerConnection</span><span style="color: #dc8cc3; background-color: #383838;">&gt;</span>
  &lt;/<span style="color: #ff1493;">scm</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org41d667a" class="outline-4">
<h4 id="org41d667a"><span class="section-number-4">2.1.3</span> Add build tag</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">build</span>&gt;
    &lt;<span style="color: #ff1493;">plugins</span>&gt;
      &lt;<span style="color: #ff1493;">plugin</span>&gt;
        &lt;<span style="color: #ff1493;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #ff1493;">groupId</span>&gt;
        &lt;<span style="color: #ff1493;">artifactId</span>&gt;maven-release-plugin&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
        &lt;<span style="color: #ff1493;">version</span>&gt;2.5.3&lt;/<span style="color: #ff1493;">version</span>&gt;
      &lt;/<span style="color: #ff1493;">plugin</span>&gt;
    &lt;/<span style="color: #ff1493;">plugins</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf87d3f9" class="outline-4">
<h4 id="orgf87d3f9"><span class="section-number-4">2.1.4</span> Provide release version</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-sh">What is the release version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:autobuil<span style="color: #dc8cc3; background-color: #383838;">dtestprj) 1.0: : 4.5.1</span>
What is SCM release tag or label for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:aut<span style="color: #dc8cc3; background-color: #383838;">obuildtestprj) autobuildtestprj-1.0: : prod</span>
What is the new development version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:<span style="color: #dc8cc3; background-color: #383838;">autobuildtestprj) 1.1-SNAPSHOT: : 4.6.1-SNAPSHOT</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b1729b" class="outline-4">
<h4 id="org5b1729b"><span class="section-number-4">2.1.5</span> Release prepare</h4>
<div class="outline-text-4" id="text-2-1-5">
<div class="org-src-container">
<pre class="src src-sh">mvn release:prepare -DdryRun=true  <span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">set up version</span>
mvn release:prepare  <span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">prepare version, may setup above</span>
mvn release:clean <span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">Removes all fils created above</span>
mvn release:perform
</pre>
</div>
</div>
</div>
<div id="outline-container-org0194e41" class="outline-4">
<h4 id="org0194e41"><span class="section-number-4">2.1.6</span> Add distributionManagementTag</h4>
<div class="outline-text-4" id="text-2-1-6">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">distributionManagement</span>&gt;
      <span style="color: #8B8989; font-style: italic;">&lt;!-- </span><span style="color: #8B8989; font-style: italic;">use the following if you're not using a snapshot version. </span><span style="color: #8B8989; font-style: italic;">--&gt;</span>
      &lt;<span style="color: #ff1493;">repository</span>&gt;
          &lt;<span style="color: #ff1493;">id</span>&gt;localSnap&lt;/<span style="color: #ff1493;">id</span>&gt;
          &lt;<span style="color: #ff1493;">name</span>&gt;RepositoryProxyRel&lt;/<span style="color: #ff1493;">name</span>&gt;
          &lt;<span style="color: #ff1493;">url</span>&gt;file:///Users/pramod/Documents/autobuildtestprj&lt;/<span style="color: #ff1493;">url</span>&gt;
      &lt;/<span style="color: #ff1493;">repository</span>&gt;
  &lt;/<span style="color: #ff1493;">distributionManagement</span>&gt;

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8dafcf5" class="outline-3">
<h3 id="org8dafcf5"><span class="section-number-3">2.2</span> Remove recursive git (i.e git prj insdie git prj) :( like in my case</h3>
</div>
<div id="outline-container-org79a6729" class="outline-3">
<h3 id="org79a6729"><span class="section-number-3">2.3</span> Return release</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">mvn release:prepare
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org60f8c0d" class="outline-2">
<h2 id="org60f8c0d"><span class="section-number-2">3</span> Add remote git repository and modify pom.xml accordingly</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh"> mkdir autobuildtestremoteprj
<span style="color: #4c83ff;">cd</span> autobuildtestremoteprj/
git init --bare .
<span style="color: #4c83ff;">cd</span> ..
ls
<span style="color: #4c83ff;">cd</span> autobuildtestprj/
ls
git remote add origin file:///Users/pramod/Documents/autobuildtestremoteprj
git push origin master
</pre>
</div>
</div>
</div>
<div id="outline-container-org2c87862" class="outline-2">
<h2 id="org2c87862"><span class="section-number-2">4</span> Finally execute</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
mvn release:clean
mvn release:prepare
mvn release:perform
# Don't use release tag, as it was already used
</pre>
</div>
</div>
