archive/Emacs/Notes.org
* Output
#+BEGIN_SRC sh
Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.3/autobuildtestprj-4.5.3-javadoc.jar (23 kB at 4.6 MB/s)
#+END_SRC
* Modified pom.xml
#+BEGIN_SRC sh
<project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
  <modelVersion>4.0.0</modelVersion>
  <groupId>org.test.autobuild</groupId>
  <artifactId>autobuildtestprj</artifactId>
  <packaging>jar</packaging>
  <version>4.5.4-SNAPSHOT</version>
  <name>autobuildtestprj</name>
  <url>http://maven.apache.org</url>
  <scm>
    <developerConnection>scm:git:file:///Users/pramod/Documents/autobuildtestremoteprj</developerConnection>
    <tag>HEAD</tag>
  </scm>

  <dependencies>
    <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
      <scope>test</scope>
    </dependency>
  </dependencies>

  <distributionManagement>
      <!-- use the following if you're not using a snapshot version. -->
      <repository>
          <id>localSnap</id>
          <name>RepositoryProxyRel</name>
          <url>file:///Users/pramod/Documents/autobuildtestremoteprj</url>
      </repository>
  </distributionManagement>

  <build>
    <plugins>
      <plugin>
        <groupId>org.apache.maven.plugins</groupId>
        <artifactId>maven-release-plugin</artifactId>
        <version>2.5.3</version>
      </plugin>
    </plugins>
  </build>
</project>
#+END_SRC
* At this point set of commands
#+BEGIN_SRC sh
rm release.properties
git add pom.xml
git commit -m "Modify for third time"
git push
git status
mvn release:clean
mvn release:prepare
mvn release:perform
#+END_SRC
* Develop will still work with SNAPSHOT
#+BEGIN_SRC
mvn clean install
[INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/autobuildtestprj-4.5.4-SNAPSHOT.jar
#+END_SRC
* Next execute mvn release:perform (Error)
#+BEGIN_SRC
mvn release:perform
 No SCM URL was provided to perform the release from
#+END_SRC
