Emacs/Notes.html
<div id="outline-container-org928c771" class="outline-2">
<h2 id="org928c771"><span class="section-number-2">5</span> Output</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh">Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org<span style="color: #dc8cc3; background-color: #383838;">/test/autobuild/autobuildtestprj/4.5.3/autobuildtestprj-4.5.3-javadoc.jar (23 kB at 4.6 MB/s)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orged4ff23" class="outline-2">
<h2 id="orged4ff23"><span class="section-number-2">6</span> Modified pom.xml</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-sh">&lt;project <span style="color: #ff69b4;">xmlns</span>=<span style="color: #61CE3C;">"http://maven.apache.org/POM/4.0.0"</span> xmlns:<span style="color: #ff69b4;">xsi</span>=<span style="color: #61CE3C;">"http://www.w3.org/</span><span style="color: #dc8cc3; background-color: #383838;">2001/XMLSchema-instance"</span><span style="color: #dc8cc3; background-color: #383838;"> xsi:</span><span style="color: #dc8cc3; background-color: #383838;">schemaLocation</span><span style="color: #dc8cc3; background-color: #383838;">=</span><span style="color: #dc8cc3; background-color: #383838;">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd"</span><span style="color: #dc8cc3; background-color: #383838;">&gt;</span>
  &lt;modelVersion&gt;4.0.0&lt;/modelVersion&gt;
  &lt;groupId&gt;org.test.autobuild&lt;/groupId&gt;
  &lt;artifactId&gt;autobuildtestprj&lt;/artifactId&gt;
  &lt;packaging&gt;jar&lt;/packaging&gt;
  &lt;version&gt;4.5.4-SNAPSHOT&lt;/version&gt;
  &lt;name&gt;autobuildtestprj&lt;/name&gt;
  &lt;url&gt;http://maven.apache.org&lt;/url&gt;
  &lt;scm&gt;
    &lt;developerConnection&gt;scm:git:file:///Users/pramod/Documents/autobuildtestrem<span style="color: #dc8cc3; background-color: #383838;">oteprj&lt;/developerConnection&gt;</span>
    &lt;tag&gt;HEAD&lt;/tag&gt;
  &lt;/scm&gt;

  &lt;dependencies&gt;
    &lt;dependency&gt;
      &lt;groupId&gt;junit&lt;/groupId&gt;
      &lt;artifactId&gt;junit&lt;/artifactId&gt;
      &lt;version&gt;3.8.1&lt;/version&gt;
      &lt;scope&gt;test&lt;/scope&gt;
    &lt;/dependency&gt;
  &lt;/dependencies&gt;

  &lt;distributionManagement&gt;
      &lt;!-- use the following if you<span style="color: #61CE3C;">'re not using a snapshot version. --&gt;</span>
<span style="color: #61CE3C;">      &lt;repository&gt;</span>
<span style="color: #61CE3C;">          &lt;id&gt;localSnap&lt;/id&gt;</span>
<span style="color: #61CE3C;">          &lt;name&gt;RepositoryProxyRel&lt;/name&gt;</span>
<span style="color: #61CE3C;">          &lt;url&gt;file:///Users/pramod/Documents/autobuildtestremoteprj&lt;/url&gt;</span>
<span style="color: #61CE3C;">      &lt;/repository&gt;</span>
<span style="color: #61CE3C;">  &lt;/distributionManagement&gt;</span>

<span style="color: #61CE3C;">  &lt;build&gt;</span>
<span style="color: #61CE3C;">    &lt;plugins&gt;</span>
<span style="color: #61CE3C;">      &lt;plugin&gt;</span>
<span style="color: #61CE3C;">        &lt;groupId&gt;org.apache.maven.plugins&lt;/groupId&gt;</span>
<span style="color: #61CE3C;">        &lt;artifactId&gt;maven-release-plugin&lt;/artifactId&gt;</span>
<span style="color: #61CE3C;">        &lt;version&gt;2.5.3&lt;/version&gt;</span>
<span style="color: #61CE3C;">      &lt;/plugin&gt;</span>
<span style="color: #61CE3C;">    &lt;/plugins&gt;</span>
<span style="color: #61CE3C;">  &lt;/build&gt;</span>
<span style="color: #61CE3C;">&lt;/project&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3481aa3" class="outline-2">
<h2 id="org3481aa3"><span class="section-number-2">7</span> At this point set of commands</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sh">rm release.properties
git add pom.xml
git commit -m <span style="color: #61CE3C;">"Modify for third time"</span>
git push
git status
mvn release:clean
mvn release:prepare
mvn release:perform
</pre>
</div>
</div>
</div>
<div id="outline-container-org7778499" class="outline-2">
<h2 id="org7778499"><span class="section-number-2">8</span> Develop will still work with SNAPSHOT</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
mvn clean install
[INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/autobuildtestprj-4.5.4-SNAPSHOT.jar
</pre>
</div>
</div>
<div id="outline-container-orgcc3b439" class="outline-2">
<h2 id="orgcc3b439"><span class="section-number-2">9</span> Next execute mvn release:perform (Error)</h2>
<div class="outline-text-2" id="text-9">
<pre class="example">
mvn release:perform
 No SCM URL was provided to perform the release from
</pre>
</div>
</div>
