archive/Emacs/Notes.org
* Log
#+BEGIN_SRC sh
bash-3.2$ mvn release:clean release:prepare
[INFO] Scanning for projects...
[INFO]
[INFO] ----------------< org.test.autobuild:autobuildtestprj >-----------------
[INFO] Building autobuildtestprj 4.5.4-SNAPSHOT
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] --- maven-release-plugin:2.5.3:clean (default-cli) @ autobuildtestprj ---
[INFO] Cleaning up after release...
[INFO]
[INFO] --- maven-release-plugin:2.5.3:prepare (default-cli) @ autobuildtestprj ---
[INFO] Verifying that there are no local modifications...
[INFO]   ignoring changes on: **/pom.xml.releaseBackup, **/pom.xml.next, **/pom.xml.tag, **/pom.xml.branch, **/release.properties, **/pom.xml.backup
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git rev-parse --show-toplevel
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git status --porcelain .
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? release.properties
[INFO] Checking dependencies and plugins for snapshots ...
What is the release version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 4.5.4: : 4.5.6
What is SCM release tag or label for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) autobuildtestprj-4.5.6: : release-4.5.6
What is the new development version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 4.5.7-SNAPSHOT: :
[INFO] Transforming 'autobuildtestprj'...
[INFO] Not generating release POMs
[INFO] Executing goals 'clean verify'...
[WARNING] Maven will be executed in interactive mode, but no input stream has been configured for this MavenInvoker instance.
[INFO] [INFO] Scanning for projects...
[INFO] [INFO]
[INFO] [INFO] ----------------< org.test.autobuild:autobuildtestprj >-----------------
[INFO] [INFO] Building autobuildtestprj 4.5.6
[INFO] [INFO] --------------------------------[ jar ]---------------------------------
[INFO] [INFO]
[INFO] [INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ autobuildtestprj ---
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:resources (default-resources) @ autobuildtestprj ---
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resources, i.e. build is platform dependent!
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobuildtestprj/src/main/resources
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ autobuildtestprj ---
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, i.e. build is platform dependent!
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestprj/target/classes
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:testResources (default-testResources) @ autobuildtestprj ---
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resources, i.e. build is platform dependent!
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobuildtestprj/src/test/resources
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ autobuildtestprj ---
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, i.e. build is platform dependent!
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestprj/target/test-classes
[INFO] [INFO]
[INFO] [INFO] --- maven-surefire-plugin:2.12.4:test (default-test) @ autobuildtestprj ---
[INFO] [INFO] Surefire report directory: /Users/pramod/Documents/autobuildtestprj/target/surefire-reports
[INFO]
[INFO] -------------------------------------------------------
[INFO]  T E S T S
[INFO] -------------------------------------------------------
[INFO] Running org.test.autobuild.AppTest
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.005 sec
[INFO]
[INFO] Results :
[INFO]
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
[INFO]
[INFO] [INFO]
[INFO] [INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ autobuildtestprj ---
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/autobuildtestprj-4.5.6.jar
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] [INFO] BUILD SUCCESS
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] [INFO] Total time: 1.471 s
[INFO] [INFO] Finished at: 2018-10-23T21:28:41-04:00
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] Checking in modified POMs...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git add -- pom.xml
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git rev-parse --show-toplevel
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git status --porcelain .
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? pom.xml.releaseBackup
[WARNING] Ignoring unrecognized line: ?? release.properties
[WARNING] Ignoring unrecognized line: ?? target/
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git commit --verbose -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-1587669494.commit pom.xml
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git symbolic-ref HEAD
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git push file:///Users/pramod/Documents/autobuildtestremoteprj refs/heads/master:refs/heads/master
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Tagging release with the label release-4.5.6...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git tag -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-850914747.commit release-4.5.6
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git push file:///Users/pramod/Documents/autobuildtestremoteprj refs/tags/release-4.5.6
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git ls-files
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Transforming 'autobuildtestprj'...
[INFO] Not removing release POMs
[INFO] Checking in modified POMs...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git add -- pom.xml
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git rev-parse --show-toplevel
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git status --porcelain .
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? pom.xml.releaseBackup
[WARNING] Ignoring unrecognized line: ?? release.properties
[WARNING] Ignoring unrecognized line: ?? target/
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git commit --verbose -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-1490696766.commit pom.xml
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git symbolic-ref HEAD
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj && git push file:///Users/pramod/Documents/autobuildtestremoteprj refs/heads/master:refs/heads/master
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Release preparation complete.
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 23.868 s
[INFO] Finished at: 2018-10-23T21:28:42-04:00
[INFO] ------------------------------------------------------------------------
bash-3.2$ ls
pom.xml			pom.xml.releaseBackup	release.properties	src			target
bash-3.2$ mvn release:perform
[INFO] Scanning for projects...
[INFO]
[INFO] ----------------< org.test.autobuild:autobuildtestprj >-----------------
[INFO] Building autobuildtestprj 4.5.7-SNAPSHOT
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] --- maven-release-plugin:2.5.3:perform (default-cli) @ autobuildtestprj ---
[INFO] Checking out the project to perform the release ...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target && git clone --branch release-4.5.6 file:///Users/pramod/Documents/autobuildtestremoteprj /Users/pramod/Documents/autobuildtestprj/target/checkout
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target
[INFO] Executing: /bin/sh -c cd /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/ && git ls-remote file:///Users/pramod/Documents/autobuildtestremoteprj
[INFO] Working directory: /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/checkout && git fetch file:///Users/pramod/Documents/autobuildtestremoteprj
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checkout
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/checkout && git checkout release-4.5.6
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checkout
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/checkout && git ls-files
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checkout
[INFO] Invoking perform goals in directory /Users/pramod/Documents/autobuildtestprj/target/checkout
[INFO] Executing goals 'deploy'...
[WARNING] Maven will be executed in interactive mode, but no input stream has been configured for this MavenInvoker instance.
[INFO] [INFO] Scanning for projects...
[INFO] [WARNING]
[INFO] [WARNING] Some problems were encountered while building the effective model for org.test.autobuild:autobuildtestprj:jar:4.5.6
[INFO] [WARNING] 'build.plugins.plugin.version' for org.apache.maven.plugins:maven-source-plugin is missing.
[INFO] [WARNING] 'build.plugins.plugin.version' for org.apache.maven.plugins:maven-javadoc-plugin is missing.
[INFO] [WARNING] 'build.plugins.plugin.version' for org.apache.maven.plugins:maven-deploy-plugin is missing.
[INFO] [WARNING]
[INFO] [WARNING] It is highly recommended to fix these problems because they threaten the stability of your build.
[INFO] [WARNING]
[INFO] [WARNING] For this reason, future Maven versions might no longer support building such malformed projects.
[INFO] [WARNING]
[INFO] [INFO]
[INFO] [INFO] ----------------< org.test.autobuild:autobuildtestprj >-----------------
[INFO] [INFO] Building autobuildtestprj 4.5.6
[INFO] [INFO] --------------------------------[ jar ]---------------------------------
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:resources (default-resources) @ autobuildtestprj ---
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resources, i.e. build is platform dependent!
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobuildtestprj/target/checkout/src/main/resources
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ autobuildtestprj ---
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, i.e. build is platform dependent!
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestprj/target/checkout/target/classes
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:testResources (default-testResources) @ autobuildtestprj ---
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resources, i.e. build is platform dependent!
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobuildtestprj/target/checkout/src/test/resources
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ autobuildtestprj ---
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, i.e. build is platform dependent!
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestprj/target/checkout/target/test-classes
[INFO] [INFO]
[INFO] [INFO] --- maven-surefire-plugin:2.12.4:test (default-test) @ autobuildtestprj ---
[INFO] [INFO] Surefire report directory: /Users/pramod/Documents/autobuildtestprj/target/checkout/target/surefire-reports
[INFO]
[INFO] -------------------------------------------------------
[INFO]  T E S T S
[INFO] -------------------------------------------------------
[INFO] Running org.test.autobuild.AppTest
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.005 sec
[INFO]
[INFO] Results :
[INFO]
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
[INFO]
[INFO] [INFO]
[INFO] [INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ autobuildtestprj ---
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6.jar
[INFO] [INFO]
[INFO] [INFO] --- maven-source-plugin:3.0.1:jar-no-fork (attach-sources) @ autobuildtestprj ---
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6-sources.jar
[INFO] [INFO]
[INFO] [INFO] --- maven-javadoc-plugin:3.0.1:jar (attach-javadocs) @ autobuildtestprj ---
[INFO] [WARNING] Source files encoding has not been set, using platform encoding UTF-8, i.e. build is platform dependent!
[INFO] [INFO]
[INFO] Loading source files for package org.test.autobuild...
[INFO] Constructing Javadoc information...
[INFO] Standard Doclet version 1.8.0_131
[INFO] Building tree for all the packages and classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/App.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/package-frame.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/package-summary.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/package-tree.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/constant-values.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/class-use/App.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/org/test/autobuild/package-use.html...
[INFO] Building index for all the packages and classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/overview-tree.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/index-all.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/deprecated-list.html...
[INFO] Building index for all classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/allclasses-frame.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/allclasses-noframe.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/index.html...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/target/apidocs/help-doc.html...
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6-javadoc.jar
[INFO] [INFO]
[INFO] [INFO] --- maven-install-plugin:2.4:install (default-install) @ autobuildtestprj ---
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkout/pom.xml to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6-sources.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkout/target/autobuildtestprj-4.5.6-javadoc.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar
[INFO] [INFO]
[INFO] [INFO] --- maven-deploy-plugin:2.7:deploy (default-deploy) @ autobuildtestprj ---
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar
[INFO] Progress (1): 2.6 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar (2.6 kB at 288 kB/s)
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom
[INFO] Progress (1): 1.3 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom (1.3 kB at 448 kB/s)
[INFO] Downloading from localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml
[INFO] Progress (1): 314 B
[INFO]
[INFO] Downloaded from localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml (314 B at 31 kB/s)
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml
[INFO] Progress (1): 345 B
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml (345 B at 172 kB/s)
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar
[INFO] Progress (1): 2.4 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar (2.4 kB at 1.2 MB/s)
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar
[INFO] Progress (1): 4.1/23 kB
[INFO] Progress (1): 8.2/23 kB
[INFO] Progress (1): 12/23 kB
[INFO] Progress (1): 16/23 kB
[INFO] Progress (1): 20/23 kB
[INFO] Progress (1): 23 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar (23 kB at 5.8 MB/s)
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] [INFO] BUILD SUCCESS
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] [INFO] Total time: 3.037 s
[INFO] [INFO] Finished at: 2018-10-23T21:28:58-04:00
[INFO] [INFO] ------------------------------------------------------------------------
[INFO] Cleaning up after release...
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 4.943 s
[INFO] Finished at: 2018-10-23T21:28:59-04:00
[INFO] ------------------------------------------------------------------------
bash-3.2$

 Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.7/autobuildtestprj-4.5.7-javadoc.jar (23 kB at 5.8 MB/s)
#+END_SRC
