Emacs/Notes.html
<div id="outline-container-orgdf56af3" class="outline-2">
<h2 id="orgdf56af3"><span class="section-number-2">10</span> Log</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-sh">bash-3.2$ mvn release:clean release:prepare
[INFO] Scanning for projects...
[INFO]
[INFO] ----------------&lt; org.test.autobuild:autobuildtestprj &gt;-----------------
[INFO] Building autobuildtestprj 4.5.4-SNAPSHOT
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] --- maven-release-plugin:2.5.3:clean (default-cli) @ autobuildtestprj ---
[INFO] Cleaning up after release...
[INFO]
[INFO] --- maven-release-plugin:2.5.3:prepare (default-cli) @ autobuildtestprj -<span style="color: #dc8cc3; background-color: #383838;">--</span>
[INFO] Verifying that there are no local modifications...
[INFO]   ignoring changes on: **/pom.xml.releaseBackup, **/pom.xml.next, **/pom.<span style="color: #dc8cc3; background-color: #383838;">xml.tag, **/pom.xml.branch, **/release.properties, **/pom.xml.backup</span>
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">rev-parse --show-toplevel</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">status --porcelain .</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? release.properties
[INFO] Checking dependencies and plugins for snapshots ...
What is the release version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:autobuil<span style="color: #dc8cc3; background-color: #383838;">dtestprj) 4.5.4: : 4.5.6</span>
What is SCM release tag or label for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:aut<span style="color: #dc8cc3; background-color: #383838;">obuildtestprj) autobuildtestprj-4.5.6: : release-4.5.6</span>
What is the new development version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:<span style="color: #dc8cc3; background-color: #383838;">autobuildtestprj) 4.5.7-SNAPSHOT: :</span>
[INFO] Transforming <span style="color: #61CE3C;">'autobuildtestprj'</span>...
[INFO] Not generating release POMs
[INFO] Executing goals <span style="color: #61CE3C;">'clean verify'</span>...
[WARNING] Maven will be executed<span style="color: #4c83ff;"> in</span> interactive mode, but no input stream has be<span style="color: #dc8cc3; background-color: #383838;">en configured for this MavenInvoker instance.</span>
[INFO] [INFO] Scanning for projects...
[INFO] [INFO]
[INFO] [INFO] ----------------&lt; org.test.autobuild:autobuildtestprj &gt;-----------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] Building autobuildtestprj 4.5.6
[INFO] [INFO] --------------------------------[ jar ]---------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j ---</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:resources (default-resources) @ aut<span style="color: #dc8cc3; background-color: #383838;">obuildtestprj ---</span>
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resou<span style="color: #dc8cc3; background-color: #383838;">rces, i.e. build is platform dependent!</span>
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobu<span style="color: #dc8cc3; background-color: #383838;">ildtestprj/src/main/resources</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ autobuil<span style="color: #dc8cc3; background-color: #383838;">dtestprj ---</span>
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, <span style="color: #dc8cc3; background-color: #383838;">i.e. build is platform dependent!</span>
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/classes</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:testResources (default-testResource<span style="color: #dc8cc3; background-color: #383838;">s) @ autobuildtestprj ---</span>
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resou<span style="color: #dc8cc3; background-color: #383838;">rces, i.e. build is platform dependent!</span>
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobu<span style="color: #dc8cc3; background-color: #383838;">ildtestprj/src/test/resources</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ <span style="color: #dc8cc3; background-color: #383838;">autobuildtestprj ---</span>
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, <span style="color: #dc8cc3; background-color: #383838;">i.e. build is platform dependent!</span>
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/test-classes</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-surefire-plugin:2.12.4:test (default-test) @ autobuildte<span style="color: #dc8cc3; background-color: #383838;">stprj ---</span>
[INFO] [INFO] Surefire report directory: /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/surefire-reports</span>
[INFO]
[INFO] -------------------------------------------------------
[INFO]  T E S T S
[INFO] -------------------------------------------------------
[INFO] Running org.test.autobuild.AppTest
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.005 sec
[INFO]
[INFO] Results :
[INFO]
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
[INFO]
[INFO] [INFO]
[INFO] [INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ autobuildtestprj ---
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/auto<span style="color: #dc8cc3; background-color: #383838;">buildtestprj-4.5.6.jar</span>
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] BUILD SUCCESS
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] Total time: 1.471 s
[INFO] [INFO] Finished at: 2018-10-23T21:28:41-04:00
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] Checking<span style="color: #4c83ff;"> in</span> modified POMs...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">add -- pom.xml</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">rev-parse --show-toplevel</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">status --porcelain .</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? pom.xml.releaseBackup
[WARNING] Ignoring unrecognized line: ?? release.properties
[WARNING] Ignoring unrecognized line: ?? target/
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">commit --verbose -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-1587669494.commit pom.xml</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">symbolic-ref HEAD</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">push file:///Users/pramod/Documents/autobuildtestremoteprj refs/heads/master:refs/heads/master</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Tagging release with the label release-4.5.6...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">tag -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-850914747.commit release-4.5.6</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">push file:///Users/pramod/Documents/autobuildtestremoteprj refs/tags/release-4.5.6</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">ls-files</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Transforming <span style="color: #61CE3C;">'autobuildtestprj'</span>...
[INFO] Not removing release POMs
[INFO] Checking<span style="color: #4c83ff;"> in</span> modified POMs...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">add -- pom.xml</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">rev-parse --show-toplevel</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">status --porcelain .</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[WARNING] Ignoring unrecognized line: ?? pom.xml.releaseBackup
[WARNING] Ignoring unrecognized line: ?? release.properties
[WARNING] Ignoring unrecognized line: ?? target/
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">commit --verbose -F /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T/maven-scm-1490696766.commit pom.xml</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">symbolic-ref HEAD</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj &amp;&amp; git <span style="color: #dc8cc3; background-color: #383838;">push file:///Users/pramod/Documents/autobuildtestremoteprj refs/heads/master:refs/heads/master</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj
[INFO] Release preparation complete.
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 23.868 s
[INFO] Finished at: 2018-10-23T21:28:42-04:00
[INFO] ------------------------------------------------------------------------
bash-3.2$ ls
pom.xml<span style="color: #ff0000; background-color: #000000;">                 </span>pom.xml.releaseBackup<span style="color: #ff0000; background-color: #000000;">   </span>release.properties<span style="color: #ff0000; background-color: #000000;">      </span>src<span style="color: #ff0000; background-color: #000000;">     </span><span style="color: #dc8cc3; background-color: #383838;">                </span><span style="color: #dc8cc3; background-color: #383838;">target</span>
bash-3.2$ mvn release:perform
[INFO] Scanning for projects...
[INFO]
[INFO] ----------------&lt; org.test.autobuild:autobuildtestprj &gt;-----------------
[INFO] Building autobuildtestprj 4.5.7-SNAPSHOT
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] --- maven-release-plugin:2.5.3:perform (default-cli) @ autobuildtestprj -<span style="color: #dc8cc3; background-color: #383838;">--</span>
[INFO] Checking out the project to perform the release ...
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target <span style="color: #dc8cc3; background-color: #383838;">&amp;&amp; git clone --branch release-4.5.6 file:///Users/pramod/Documents/autobuildtestremoteprj /Users/pramod/Documents/autobuildtestprj/target/checkout</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target
[INFO] Executing: /bin/sh -c cd /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T<span style="color: #dc8cc3; background-color: #383838;">/ &amp;&amp; git ls-remote file:///Users/pramod/Documents/autobuildtestremoteprj</span>
[INFO] Working directory: /var/folders/ww/twdlb2_d45x8r8d5_m537j940000gn/T
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/<span style="color: #dc8cc3; background-color: #383838;">checkout &amp;&amp; git fetch file:///Users/pramod/Documents/autobuildtestremoteprj</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checko<span style="color: #dc8cc3; background-color: #383838;">ut</span>
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/<span style="color: #dc8cc3; background-color: #383838;">checkout &amp;&amp; git checkout release-4.5.6</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checko<span style="color: #dc8cc3; background-color: #383838;">ut</span>
[INFO] Executing: /bin/sh -c cd /Users/pramod/Documents/autobuildtestprj/target/<span style="color: #dc8cc3; background-color: #383838;">checkout &amp;&amp; git ls-files</span>
[INFO] Working directory: /Users/pramod/Documents/autobuildtestprj/target/checko<span style="color: #dc8cc3; background-color: #383838;">ut</span>
[INFO] Invoking perform goals<span style="color: #4c83ff;"> in</span> directory /Users/pramod/Documents/autobuildtest<span style="color: #dc8cc3; background-color: #383838;">prj/target/checkout</span>
[INFO] Executing goals <span style="color: #61CE3C;">'deploy'</span>...
[WARNING] Maven will be executed<span style="color: #4c83ff;"> in</span> interactive mode, but no input stream has be<span style="color: #dc8cc3; background-color: #383838;">en configured for this MavenInvoker instance.</span>
[INFO] [INFO] Scanning for projects...
[INFO] [WARNING]
[INFO] [WARNING] Some problems were encountered while building the effective mod<span style="color: #dc8cc3; background-color: #383838;">el for org.test.autobuild:autobuildtestprj:jar:4.5.6</span>
[INFO] [WARNING] <span style="color: #61CE3C;">'build.plugins.plugin.version'</span> for org.apache.maven.plugins:mav<span style="color: #dc8cc3; background-color: #383838;">en-source-plugin is missing.</span>
[INFO] [WARNING] <span style="color: #61CE3C;">'build.plugins.plugin.version'</span> for org.apache.maven.plugins:mav<span style="color: #dc8cc3; background-color: #383838;">en-javadoc-plugin is missing.</span>
[INFO] [WARNING] <span style="color: #61CE3C;">'build.plugins.plugin.version'</span> for org.apache.maven.plugins:mav<span style="color: #dc8cc3; background-color: #383838;">en-deploy-plugin is missing.</span>
[INFO] [WARNING]
[INFO] [WARNING] It is highly recommended to fix these problems because they thr<span style="color: #dc8cc3; background-color: #383838;">eaten the stability of your build.</span>
[INFO] [WARNING]
[INFO] [WARNING] For this reason, future Maven versions might no longer support <span style="color: #dc8cc3; background-color: #383838;">building such malformed projects.</span>
[INFO] [WARNING]
[INFO] [INFO]
[INFO] [INFO] ----------------&lt; org.test.autobuild:autobuildtestprj &gt;-----------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] Building autobuildtestprj 4.5.6
[INFO] [INFO] --------------------------------[ jar ]---------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:resources (default-resources) @ aut<span style="color: #dc8cc3; background-color: #383838;">obuildtestprj ---</span>
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resou<span style="color: #dc8cc3; background-color: #383838;">rces, i.e. build is platform dependent!</span>
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobu<span style="color: #dc8cc3; background-color: #383838;">ildtestprj/target/checkout/src/main/resources</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ autobuil<span style="color: #dc8cc3; background-color: #383838;">dtestprj ---</span>
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, <span style="color: #dc8cc3; background-color: #383838;">i.e. build is platform dependent!</span>
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/checkout/target/classes</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-resources-plugin:2.6:testResources (default-testResource<span style="color: #dc8cc3; background-color: #383838;">s) @ autobuildtestprj ---</span>
[INFO] [WARNING] Using platform encoding (UTF-8 actually) to copy filtered resou<span style="color: #dc8cc3; background-color: #383838;">rces, i.e. build is platform dependent!</span>
[INFO] [INFO] skip non existing resourceDirectory /Users/pramod/Documents/autobu<span style="color: #dc8cc3; background-color: #383838;">ildtestprj/target/checkout/src/test/resources</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ <span style="color: #dc8cc3; background-color: #383838;">autobuildtestprj ---</span>
[INFO] [INFO] Changes detected - recompiling the module!
[INFO] [WARNING] File encoding has not been set, using platform encoding UTF-8, <span style="color: #dc8cc3; background-color: #383838;">i.e. build is platform dependent!</span>
[INFO] [INFO] Compiling 1 source file to /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/checkout/target/test-classes</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-surefire-plugin:2.12.4:test (default-test) @ autobuildte<span style="color: #dc8cc3; background-color: #383838;">stprj ---</span>
[INFO] [INFO] Surefire report directory: /Users/pramod/Documents/autobuildtestpr<span style="color: #dc8cc3; background-color: #383838;">j/target/checkout/target/surefire-reports</span>
[INFO]
[INFO] -------------------------------------------------------
[INFO]  T E S T S
[INFO] -------------------------------------------------------
[INFO] Running org.test.autobuild.AppTest
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.005 sec
[INFO]
[INFO] Results :
[INFO]
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
[INFO]
[INFO] [INFO]
[INFO] [INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ autobuildtestprj ---
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/chec<span style="color: #dc8cc3; background-color: #383838;">kout/target/autobuildtestprj-4.5.6.jar</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-source-plugin:3.0.1:jar-no-fork (attach-sources) @ autob<span style="color: #dc8cc3; background-color: #383838;">uildtestprj ---</span>
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/chec<span style="color: #dc8cc3; background-color: #383838;">kout/target/autobuildtestprj-4.5.6-sources.jar</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-javadoc-plugin:3.0.1:jar (attach-javadocs) @ autobuildte<span style="color: #dc8cc3; background-color: #383838;">stprj ---</span>
[INFO] [WARNING] Source files encoding has not been set, using platform encoding<span style="color: #dc8cc3; background-color: #383838;"> UTF-8, i.e. build is platform dependent!</span>
[INFO] [INFO]
[INFO] Loading source files for package org.test.autobuild...
[INFO] Constructing Javadoc information...
[INFO] Standard Doclet version 1.8.0_131
[INFO] Building tree for all the packages and classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/App.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/package-frame.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/package-summary.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/package-tree.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/constant-values.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/class-use/App.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/org/test/autobuild/package-use.html...</span>
[INFO] Building index for all the packages and classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/overview-tree.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/index-all.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/deprecated-list.html...</span>
[INFO] Building index for all classes...
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/allclasses-frame.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/allclasses-noframe.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/index.html...</span>
[INFO] Generating /Users/pramod/Documents/autobuildtestprj/target/checkout/targe<span style="color: #dc8cc3; background-color: #383838;">t/apidocs/help-doc.html...</span>
[INFO] [INFO] Building jar: /Users/pramod/Documents/autobuildtestprj/target/chec<span style="color: #dc8cc3; background-color: #383838;">kout/target/autobuildtestprj-4.5.6-javadoc.jar</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-install-plugin:2.4:install (default-install) @ autobuild<span style="color: #dc8cc3; background-color: #383838;">testprj ---</span>
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkou<span style="color: #dc8cc3; background-color: #383838;">t/target/autobuildtestprj-4.5.6.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar</span>
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkou<span style="color: #dc8cc3; background-color: #383838;">t/pom.xml to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom</span>
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkou<span style="color: #dc8cc3; background-color: #383838;">t/target/autobuildtestprj-4.5.6-sources.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar</span>
[INFO] [INFO] Installing /Users/pramod/Documents/autobuildtestprj/target/checkou<span style="color: #dc8cc3; background-color: #383838;">t/target/autobuildtestprj-4.5.6-javadoc.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar</span>
[INFO] [INFO]
[INFO] [INFO] --- maven-deploy-plugin:2.7:deploy (default-deploy) @ autobuildtes<span style="color: #dc8cc3; background-color: #383838;">tprj ---</span>
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremot<span style="color: #dc8cc3; background-color: #383838;">eprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar</span>
[INFO] Progress (1): 2.6 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremote<span style="color: #dc8cc3; background-color: #383838;">prj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.jar (2.6 kB at 288 kB/s)</span>
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremot<span style="color: #dc8cc3; background-color: #383838;">eprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom</span>
[INFO] Progress (1): 1.3 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremote<span style="color: #dc8cc3; background-color: #383838;">prj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6.pom (1.3 kB at 448 kB/s)</span>
[INFO] Downloading from localSnap: file:///Users/pramod/Documents/autobuildtestr<span style="color: #dc8cc3; background-color: #383838;">emoteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml</span>
[INFO] Progress (1): 314 B
[INFO]
[INFO] Downloaded from localSnap: file:///Users/pramod/Documents/autobuildtestre<span style="color: #dc8cc3; background-color: #383838;">moteprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml (314 B at 31 kB/s)</span>
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremot<span style="color: #dc8cc3; background-color: #383838;">eprj/org/test/autobuild/autobuildtestprj/maven-metadata.xml</span>
[INFO] Progress (1): 345 B
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremote<span style="color: #dc8cc3; background-color: #383838;">prj/org/test/autobuild/autobuildtestprj/maven-metadata.xml (345 B at 172 kB/s)</span>
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremot<span style="color: #dc8cc3; background-color: #383838;">eprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar</span>
[INFO] Progress (1): 2.4 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremote<span style="color: #dc8cc3; background-color: #383838;">prj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-sources.jar (2.4 kB at 1.2 MB/s)</span>
[INFO] Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremot<span style="color: #dc8cc3; background-color: #383838;">eprj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar</span>
[INFO] Progress (1): 4.1/23 kB
[INFO] Progress (1): 8.2/23 kB
[INFO] Progress (1): 12/23 kB
[INFO] Progress (1): 16/23 kB
[INFO] Progress (1): 20/23 kB
[INFO] Progress (1): 23 kB
[INFO]
[INFO] Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremote<span style="color: #dc8cc3; background-color: #383838;">prj/org/test/autobuild/autobuildtestprj/4.5.6/autobuildtestprj-4.5.6-javadoc.jar (23 kB at 5.8 MB/s)</span>
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] BUILD SUCCESS
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] [INFO] Total time: 3.037 s
[INFO] [INFO] Finished at: 2018-10-23T21:28:58-04:00
[INFO] [INFO] ------------------------------------------------------------------<span style="color: #dc8cc3; background-color: #383838;">------</span>
[INFO] Cleaning up after release...
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 4.943 s
[INFO] Finished at: 2018-10-23T21:28:59-04:00
[INFO] ------------------------------------------------------------------------
bash-3.2$

 Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/or<span style="color: #dc8cc3; background-color: #383838;">g/test/autobuild/autobuildtestprj/4.5.7/autobuildtestprj-4.5.7-javadoc.jar (23 kB at 5.8 MB/s)</span>
</pre>
</div>
</div>
</div>
