archive/Emacs/Notes.org
* Now able to automate with mvn release:prepare and release:perform
#+BEGIN_SRC sh
 mvn release:prepare release:perform
Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.8/autobuildtestprj-4.5.8-javadoc.jar (23 kB at 5.8 MB/s)


# But keeps on asking for version numbers with incremented version
What is the release version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 4.5.9: :
What is SCM release tag or label for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) autobuildtestprj-4.5.9: :
What is the new development version for "autobuildtestprj"? (org.test.autobuild:autobuildtestprj) 4.5.10-SNAPSHOT: :
Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.9/autobuildtestprj-4.5.9-javadoc.jar (23 kB at 5.8 MB/s)


#+END_SRC
* Batch mode options
#+BEGIN_SRC sh
mvn --batch-mode -Dtag=my-proj-1.2 release:prepare \
                 -DreleaseVersion=1.2 \
                 -DdevelopmentVersion=2.0-SNAPSHOT
mvn --batch-mode release:prepare release:perform

 Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.11/autobuildtestprj-4.5.11-javadoc.jar (23 kB at 5.8 MB/s)

mvn clean install

Installing /Users/pramod/Documents/Programming/projects/online_git_repos/neppramod/problems_practice/try/mavenabutobuilder/firstprj/autobuildtestprj/target/autobuildtestprj-4.5.12-SNAPSHOT.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.12-SNAPSHOT/autobuildtestprj-4.5.12-SNAPSHOT.jar

# Increments develop version number based on release number
mvn --batch-mode release:prepare release:perform
Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org/test/autobuild/autobuildtestprj/4.5.12/autobuildtestprj-4.5.12-javadoc.jar

mvn clean install
 Installing /Users/pramod/Documents/Programming/projects/online_git_repos/neppramod/problems_practice/try/mavenabutobuilder/firstprj/autobuildtestprj/target/autobuildtestprj-4.5.13-SNAPSHOT.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.13-SNAPSHOT/autobuildtestprj-4.5.13-SNAPSHOT.jar
#+END_SRC
* Revisit pom.xml with all the changes
#+BEGIN_SRC xml
<project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
  <modelVersion>4.0.0</modelVersion>
  <groupId>org.test.autobuild</groupId>
  <artifactId>autobuildtestprj</artifactId>
  <packaging>jar</packaging>
  <version>4.5.13-SNAPSHOT</version>
  <name>autobuildtestprj</name>
  <url>http://maven.apache.org</url>
  <scm>
      <developerConnection>scm:git:file:///Users/pramod/Documents/autobuildtestremoteprj</developerConnection>
        <tag>HEAD</tag>
  </scm>

  <dependencies>
    <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
      <scope>test</scope>
    </dependency>
  </dependencies>

  <distributionManagement>
      <!-- use the following if you're not using a snapshot version. -->
      <repository>
          <id>localSnap</id>
          <name>RepositoryProxyRel</name>
          <url>file:///Users/pramod/Documents/autobuildtestremoteprj</url>
      </repository>
  </distributionManagement>

  <build>
    <plugins>
      <plugin>
        <groupId>org.apache.maven.plugins</groupId>
        <artifactId>maven-release-plugin</artifactId>
        <version>2.5.3</version>
      </plugin>
    </plugins>
  </build>
#+END_SRC
* Links
- [[https://maven.apache.org/maven-release/maven-release-plugin/examples/non-interactive-release.html][Non Interactive release]]
- [[https://stackoverflow.com/questions/29143825/no-scm-url-was-provided-to-perform-the-release-from][No SCM URL was provided]]
- [[https://stackoverflow.com/questions/18943347/how-to-run-releaseperform-from-a-given-git-tag/][Release Perform for given git tag]]
- [[https://stackoverflow.com/questions/5910037/maven-repository-element-was-not-specified-in-the-pom-inside-distributionmanage][Repository Element Was not Specified]]
- [[http://maven.apache.org/maven-release/maven-release-plugin/][Release Plugin]]
- [[http://maven.apache.org/maven-release/maven-release-plugin/usage.html][Release Plugin Usage]]
