Emacs/Notes.html
<div id="outline-container-org0618dda" class="outline-2">
<h2 id="org0618dda"><span class="section-number-2">11</span> Now able to automate with mvn release:prepare and release:perform</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-sh"> mvn release:prepare release:perform
Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org<span style="color: #dc8cc3; background-color: #383838;">/test/autobuild/autobuildtestprj/4.5.8/autobuildtestprj-4.5.8-javadoc.jar (23 kB at 5.8 MB/s)</span>


<span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">But keeps on asking for version numbers with incremented version</span>
What is the release version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:autobuil<span style="color: #dc8cc3; background-color: #383838;">dtestprj) 4.5.9: :</span>
What is SCM release tag or label for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:aut<span style="color: #dc8cc3; background-color: #383838;">obuildtestprj) autobuildtestprj-4.5.9: :</span>
What is the new development version for <span style="color: #61CE3C;">"autobuildtestprj"</span>? (org.test.autobuild:<span style="color: #dc8cc3; background-color: #383838;">autobuildtestprj) 4.5.10-SNAPSHOT: :</span>
Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/org<span style="color: #dc8cc3; background-color: #383838;">/test/autobuild/autobuildtestprj/4.5.9/autobuildtestprj-4.5.9-javadoc.jar (23 kB at 5.8 MB/s)</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-orgffa788f" class="outline-2">
<h2 id="orgffa788f"><span class="section-number-2">12</span> Batch mode options</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-sh">mvn --batch-mode -Dtag=my-proj-1.2 release:prepare <span style="color: #61CE3C;">\</span>
                 -DreleaseVersion=1.2 <span style="color: #61CE3C;">\</span>
                 -DdevelopmentVersion=2.0-SNAPSHOT
mvn --batch-mode release:prepare release:perform

 Uploaded to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/or<span style="color: #dc8cc3; background-color: #383838;">g/test/autobuild/autobuildtestprj/4.5.11/autobuildtestprj-4.5.11-javadoc.jar (23 kB at 5.8 MB/s)</span>

mvn clean install

Installing /Users/pramod/Documents/Programming/projects/online_git_repos/neppram<span style="color: #dc8cc3; background-color: #383838;">od/problems_practice/try/mavenabutobuilder/firstprj/autobuildtestprj/target/autobuildtestprj-4.5.12-SNAPSHOT.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.12-SNAPSHOT/autobuildtestprj-4.5.12-SNAPSHOT.jar</span>

<span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">Increments develop version number based on release number</span>
mvn --batch-mode release:prepare release:perform
Uploading to localSnap: file:///Users/pramod/Documents/autobuildtestremoteprj/or<span style="color: #dc8cc3; background-color: #383838;">g/test/autobuild/autobuildtestprj/4.5.12/autobuildtestprj-4.5.12-javadoc.jar</span>

mvn clean install
 Installing /Users/pramod/Documents/Programming/projects/online_git_repos/neppra<span style="color: #dc8cc3; background-color: #383838;">mod/problems_practice/try/mavenabutobuilder/firstprj/autobuildtestprj/target/autobuildtestprj-4.5.13-SNAPSHOT.jar to /Users/pramod/.m2/repository/org/test/autobuild/autobuildtestprj/4.5.13-SNAPSHOT/autobuildtestprj-4.5.13-SNAPSHOT.jar</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf0dd951" class="outline-2">
<h2 id="orgf0dd951"><span class="section-number-2">13</span> Revisit pom.xml with all the changes</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #ff1493;">project</span> <span style="color: #4c83ff;">xmlns</span>=<span style="color: #61CE3C;">"http://maven.apache.org/POM/4.0.0"</span> <span style="color: #4c83ff;">xmlns</span>:<span style="color: #ff69b4;">xsi</span>=<span style="color: #61CE3C;">"http://www.w3.org/</span><span style="color: #dc8cc3; background-color: #383838;">2001/XMLSchema-instance"</span><span style="color: #dc8cc3; background-color: #383838;"> </span><span style="color: #dc8cc3; background-color: #383838;">xsi</span><span style="color: #dc8cc3; background-color: #383838;">:</span><span style="color: #dc8cc3; background-color: #383838;">schemaLocation</span><span style="color: #dc8cc3; background-color: #383838;">=</span><span style="color: #dc8cc3; background-color: #383838;">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd"</span><span style="color: #dc8cc3; background-color: #383838;">&gt;</span>
  &lt;<span style="color: #ff1493;">modelVersion</span>&gt;4.0.0&lt;/<span style="color: #ff1493;">modelVersion</span>&gt;
  &lt;<span style="color: #ff1493;">groupId</span>&gt;org.test.autobuild&lt;/<span style="color: #ff1493;">groupId</span>&gt;
  &lt;<span style="color: #ff1493;">artifactId</span>&gt;autobuildtestprj&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
  &lt;<span style="color: #ff1493;">packaging</span>&gt;jar&lt;/<span style="color: #ff1493;">packaging</span>&gt;
  &lt;<span style="color: #ff1493;">version</span>&gt;4.5.13-SNAPSHOT&lt;/<span style="color: #ff1493;">version</span>&gt;
  &lt;<span style="color: #ff1493;">name</span>&gt;autobuildtestprj&lt;/<span style="color: #ff1493;">name</span>&gt;
  &lt;<span style="color: #ff1493;">url</span>&gt;http://maven.apache.org&lt;/<span style="color: #ff1493;">url</span>&gt;
  &lt;<span style="color: #ff1493;">scm</span>&gt;
      &lt;<span style="color: #ff1493;">developerConnection</span>&gt;scm:git:file:///Users/pramod/Documents/autobuildtestr<span style="color: #dc8cc3; background-color: #383838;">emoteprj</span><span style="color: #dc8cc3; background-color: #383838;">&lt;</span><span style="color: #dc8cc3; background-color: #383838;">/</span><span style="color: #dc8cc3; background-color: #383838;">developerConnection</span><span style="color: #dc8cc3; background-color: #383838;">&gt;</span>
        &lt;<span style="color: #ff1493;">tag</span>&gt;HEAD&lt;/<span style="color: #ff1493;">tag</span>&gt;
  &lt;/<span style="color: #ff1493;">scm</span>&gt;

  &lt;<span style="color: #ff1493;">dependencies</span>&gt;
    &lt;<span style="color: #ff1493;">dependency</span>&gt;
      &lt;<span style="color: #ff1493;">groupId</span>&gt;junit&lt;/<span style="color: #ff1493;">groupId</span>&gt;
      &lt;<span style="color: #ff1493;">artifactId</span>&gt;junit&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
      &lt;<span style="color: #ff1493;">version</span>&gt;3.8.1&lt;/<span style="color: #ff1493;">version</span>&gt;
      &lt;<span style="color: #ff1493;">scope</span>&gt;test&lt;/<span style="color: #ff1493;">scope</span>&gt;
    &lt;/<span style="color: #ff1493;">dependency</span>&gt;
  &lt;/<span style="color: #ff1493;">dependencies</span>&gt;

  &lt;<span style="color: #ff1493;">distributionManagement</span>&gt;
      <span style="color: #8B8989; font-style: italic;">&lt;!-- </span><span style="color: #8B8989; font-style: italic;">use the following if you're not using a snapshot version. </span><span style="color: #8B8989; font-style: italic;">--&gt;</span>
      &lt;<span style="color: #ff1493;">repository</span>&gt;
          &lt;<span style="color: #ff1493;">id</span>&gt;localSnap&lt;/<span style="color: #ff1493;">id</span>&gt;
          &lt;<span style="color: #ff1493;">name</span>&gt;RepositoryProxyRel&lt;/<span style="color: #ff1493;">name</span>&gt;
          &lt;<span style="color: #ff1493;">url</span>&gt;file:///Users/pramod/Documents/autobuildtestremoteprj&lt;/<span style="color: #ff1493;">url</span>&gt;
      &lt;/<span style="color: #ff1493;">repository</span>&gt;
  &lt;/<span style="color: #ff1493;">distributionManagement</span>&gt;

  &lt;<span style="color: #ff1493;">build</span>&gt;
    &lt;<span style="color: #ff1493;">plugins</span>&gt;
      &lt;<span style="color: #ff1493;">plugin</span>&gt;
        &lt;<span style="color: #ff1493;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #ff1493;">groupId</span>&gt;
        &lt;<span style="color: #ff1493;">artifactId</span>&gt;maven-release-plugin&lt;/<span style="color: #ff1493;">artifactId</span>&gt;
        &lt;<span style="color: #ff1493;">version</span>&gt;2.5.3&lt;/<span style="color: #ff1493;">version</span>&gt;
      &lt;/<span style="color: #ff1493;">plugin</span>&gt;
    &lt;/<span style="color: #ff1493;">plugins</span>&gt;
  &lt;/<span style="color: #ff1493;">build</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org59cbf04" class="outline-2">
<h2 id="org59cbf04"><span class="section-number-2">14</span> Links</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li><a href="https://maven.apache.org/maven-release/maven-release-plugin/examples/non-interactive-release.html">Non Interactive release</a></li>
<li><a href="https://stackoverflow.com/questions/29143825/no-scm-url-was-provided-to-perform-the-release-from">No SCM URL was provided</a></li>
<li><a href="https://stackoverflow.com/questions/18943347/how-to-run-releaseperform-from-a-given-git-tag/">Release Perform for given git tag</a></li>
<li><a href="https://stackoverflow.com/questions/5910037/maven-repository-element-was-not-specified-in-the-pom-inside-distributionmanage">Repository Element Was not Specified</a></li>
<li><a href="http://maven.apache.org/maven-release/maven-release-plugin/">Release Plugin</a></li>
<li><a href="http://maven.apache.org/maven-release/maven-release-plugin/usage.html">Release Plugin Usage</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pramod Nepal</p>
<p class="date">Created: 2018-10-23 Tue 22:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
